
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/hawk0616/recruit-service-board-infla/actions/runs/6138318478)



<pre><code>Apply complete! Resources: 5 added, 3 changed, 1 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-06a74de91e584f523]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-045bc34d7c279cb27]
aws_subnet.rds_subnet: Refreshing state... [id=subnet-0b82a1db37327b596]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-027284c710a0d8892]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0ef372ea55e63234b]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0b4fa9cfb59fb8ed6]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0b66a8be9a7ddf00e]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-06b113e053f3b1456]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0c5a36c42816c6a6e]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0e0e6b1c0c1ac041b]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-06d46b412cd4c9c97]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-00f307d2ae25b4534]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0c8a12a9773686205]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-031bf5efc3f63faec]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-09fbc8a2cc5227fc3]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-088311edf380f4573]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-07700ba4124e8d2ab]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-00f307d2ae25b45341080289494]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-048f407a5f7b59690]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0c5a36c42816c6a6e1080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.vpc.aws_eip.nat[1] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "aws-ecs-terraform-ap-northeast-1c"
        }
      + tags_all             = {
          + "Name" = "aws-ecs-terraform-ap-northeast-1c"
        }
      + vpc                  = (known after apply)
    }

  # module.vpc.aws_nat_gateway.this[0] must be replaced
-/+ resource "aws_nat_gateway" "this" {
      ~ allocation_id        = "eipalloc-09fbc8a2cc5227fc3" # forces replacement -> (known after apply) # forces replacement
      ~ association_id       = "eipassoc-0fef2f53518d06c59" -> (known after apply)
      ~ id                   = "nat-048f407a5f7b59690" -> (known after apply)
      ~ network_interface_id = "eni-01f69d364f32f02c7" -> (known after apply)
      ~ private_ip           = "10.0.11.165" -> (known after apply)
      ~ public_ip            = "52.68.111.132" -> (known after apply)
        tags                 = {
            "Name" = "aws-ecs-terraform-ap-northeast-1a"
        }
        # (3 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.this[1] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = "subnet-045bc34d7c279cb27"
      + tags                 = {
          + "Name" = "aws-ecs-terraform-ap-northeast-1c"
        }
      + tags_all             = {
          + "Name" = "aws-ecs-terraform-ap-northeast-1c"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be updated in-place
  ~ resource "aws_route" "private_nat_gateway" {
        id                     = "r-rtb-0c5a36c42816c6a6e1080289494"
      ~ nat_gateway_id         = "nat-048f407a5f7b59690" -> (known after apply)
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_route.private_nat_gateway[1] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0c5a36c42816c6a6e"
      ~ tags             = {
          ~ "Name" = "aws-ecs-terraform-private" -> "aws-ecs-terraform-private-ap-northeast-1a"
        }
      ~ tags_all         = {
          ~ "Name" = "aws-ecs-terraform-private" -> "aws-ecs-terraform-private-ap-northeast-1a"
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "aws-ecs-terraform-private-ap-northeast-1c"
        }
      + tags_all         = {
          + "Name" = "aws-ecs-terraform-private-ap-northeast-1c"
        }
      + vpc_id           = "vpc-06a74de91e584f523"
    }

  # module.vpc.aws_route_table_association.private[1] will be updated in-place
  ~ resource "aws_route_table_association" "private" {
        id             = "rtbassoc-0c8a12a9773686205"
      ~ route_table_id = "rtb-0c5a36c42816c6a6e" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 5 to add, 3 to change, 1 to destroy.
module.vpc.aws_nat_gateway.this[0]: Destroying... [id=nat-048f407a5f7b59690]
module.vpc.aws_route_table.private[1]: Creating...
module.vpc.aws_route_table.private[0]: Modifying... [id=rtb-0c5a36c42816c6a6e]
module.vpc.aws_route_table.private[0]: Modifications complete after 1s [id=rtb-0c5a36c42816c6a6e]
module.vpc.aws_route_table.private[1]: Creation complete after 1s [id=rtb-09e72ede8507a7ede]
module.vpc.aws_route_table_association.private[1]: Modifying... [id=rtbassoc-0c8a12a9773686205]
module.vpc.aws_route_table_association.private[1]: Modifications complete after 1s [id=rtbassoc-0dd3ed9e6c5dcdb96]
module.vpc.aws_nat_gateway.this[0]: Still destroying... [id=nat-048f407a5f7b59690, 10s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still destroying... [id=nat-048f407a5f7b59690, 20s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still destroying... [id=nat-048f407a5f7b59690, 30s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still destroying... [id=nat-048f407a5f7b59690, 40s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still destroying... [id=nat-048f407a5f7b59690, 50s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still destroying... [id=nat-048f407a5f7b59690, 1m0s elapsed]
module.vpc.aws_nat_gateway.this[0]: Destruction complete after 1m2s
module.vpc.aws_eip.nat[1]: Creating...
module.vpc.aws_eip.nat[1]: Creation complete after 1s [id=eipalloc-05212acebdfd26b46]
module.vpc.aws_nat_gateway.this[0]: Creating...
module.vpc.aws_nat_gateway.this[1]: Creating...
module.vpc.aws_nat_gateway.this[0]: Still creating... [10s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [10s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [20s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [20s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [30s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [30s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [40s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [40s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [50s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [50s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [1m0s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [1m0s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [1m10s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [1m10s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [1m20s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [1m20s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [1m30s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [1m30s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [1m40s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [1m40s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [1m50s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [1m50s elapsed]
module.vpc.aws_nat_gateway.this[0]: Creation complete after 1m55s [id=nat-0f95a65c3fedee2a9]
module.vpc.aws_nat_gateway.this[1]: Creation complete after 1m57s [id=nat-00ecc0f91b532aa39]
module.vpc.aws_route.private_nat_gateway[1]: Creating...
module.vpc.aws_route.private_nat_gateway[0]: Modifying... [id=r-rtb-0c5a36c42816c6a6e1080289494]
module.vpc.aws_route.private_nat_gateway[1]: Creation complete after 1s [id=r-rtb-09e72ede8507a7ede1080289494]
module.vpc.aws_route.private_nat_gateway[0]: Modifications complete after 1s [id=r-rtb-0c5a36c42816c6a6e1080289494]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 5 added, 3 changed, 1 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":5,"Program":"tfcmt","SHA1":"debd2c797979c1f0bf087bde2152553e1785ae94","Vars":{},"WorkflowName":"Terraform"} -->